<?php
return [
	'result' => '0',	//失败
	'result' => '1',	//成功

	'code' => [
		'001' => '登录失败',
		'002' => '注册失败',
		'003' => '好友数量达到上限',
		'004' => '参数错误',
		'005' => '重复添加好友',
		'006' => '未登录',
		'007' => '数据库操作失败,回滚',
		
	],

	'command' => [		//socket发送数据命令
		'101' => '用户上线，发送给用户好友',
		'102' => '用户下线，发送给用户好友',
		'103' => '私聊消息通知',
		'104' => '群聊消息通知',
		'105' => '重复发送请求',
		'106' => '请求通知',
		'107' => '同意添加好友',
		'108' => '拒绝添加好友',
	]，

	'pmessage' => [
		'status' => [
			'1' => '未读',
			'2' => '已读',
		],
		'type' => [
			'0' => '普通消息',
			'1' => '加好友请求',
			'2' => '已同意',
			'3' => '已拒绝',
		],
	],
];
?>